Revit 2024 API
BendingDetailAngularDimensionsDisplayOptions Enumeration
 Describes the angular dimensions display options.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Since: 2024
Syntax
C#
public enum BendingDetailAngularDimensionsDisplayOptions
Visual Basic
Public Enumeration BendingDetailAngularDimensionsDisplayOptions
Visual C++
public enum class BendingDetailAngularDimensionsDisplayOptions
Members
Member name | Description
AllAngles |  Display for all angle values.
Exclude90Degrees |  Display for all angle values except the 90 degree.
See Also
Autodesk.Revit.DB.Structure Namespace